{
  "rows": [
    {"row": {"query": "My order hasn't arrived yet.", "response": "We apologize for the inconvenience. Can you please provide your order number so we can investigate?"}},
    {"row": {"query": "I received a damaged product.", "response": "We apologize for the inconvenience. Can you please provide a photo of the damaged product so we can assist you further?"}},
    {"row": {"query": "I need to return an item.", "response": "Certainly. Please provide your order number and reason for return, and we will provide you with instructions on how to proceed."}},
    {"row": {"query": "I want to change my shipping address.", "response": "No problem. Can you please provide your order number and the new shipping address you'd like to use?"}},
    {"row": {"query": "I have a question about my bill.", "response": "We'd be happy to help. Can you please provide your account number and a brief description of your question?"}},
    {"row": {"query": "How do I cancel my subscription?", "response": "We're sorry to hear that. Can you please provide your account email and the name of the subscription you'd like to cancel?"}},
    {"row": {"query": "Can I get a refund for my purchase?", "response": "We understand your concern. Please provide your order number and the reason for your refund request so we can assist you further."}},
    {"row": {"query": "I'd like to track my order.", "response": "Of course. Can you please provide your order number so we can check the current status for you?"}},
    {"row": {"query": "My account has been locked.", "response": "We apologize for the inconvenience. Can you please provide your account email so we can help you regain access?"}},
    {"row": {"query": "I can't find the item I'm looking for.", "response": "We're here to help. Can you please provide a description or product name of the item you're looking for so we can assist you?"}},
    {"row": {"query": "I'm having trouble applying a promo code.", "response": "We apologize for the inconvenience. Can you please provide the promo code you're trying to use, and we'll help you resolve the issue?"}},
    {"row": {"query": "How do I update my payment information?", "response": "We can help with that. Can you please provide your account email so we can guide you through updating your payment information?"}},
    {"row": {"query": "I haven't received a response to my email inquiry.", "response": "We apologize for the delay. Can you please provide your ticket number or account email so we can follow up on your inquiry?"}},
    {"row": {"query": "Can I change the size of an item in my order?", "response": "Certainly. Can you please provide your order number and the details of the item you'd like to change?"}},
    {"row": {"query": "What is the status of my warranty claim?", "response": "We'd be happy to check for you. Can you please provide your claim number or the product's serial number?"}},
    {"row": {"query": "Is my item in stock?", "response": "To check availability, can you please provide the product name or SKU so we can assist you?"}},
    {"row": {"query": "My promo code has expired. Can I still use it?", "response": "Unfortunately, expired promo codes cannot be used. However, please provide the code, and we'll see if there's a similar offer currently available."}},
    {"row": {"query": "How do I reset my password?", "response": "We can help with that. Please provide your account email, and we'll send you instructions on how to reset your password."}},
    {"row": {"query": "Can I place a bulk order?", "response": "Certainly. Can you please provide the product name or SKU, and the quantity you'd like to order so we can check availability and pricing?"}},
    {"row": {"query": "How do I apply for a job at your company?", "response": "Thank you for your interest. Can you please provide your email address so we can send you information on how to apply?"}},
    {"row": {"query": "Can I add an item to an existing order?", "response": "We'll do our best to help. Can you please provide your order number and the details of the item you'd like to add?"}},
    {"row": {"query": "How long does shipping take?", "response": "We'd be happy to provide an estimate. Can you please provide your shipping destination and the product name or SKU?"}},
    {"row": {"query": "I was charged twice for my order.", "response": "We apologize for the inconvenience. Can you please provide your order number so we can investigate and resolve the issue?"}},
    {"row": {"query": "Where can I find your sizing chart?", "response": "We'd be happy to help. Can you please provide the product name or SKU so we can direct you to the appropriate sizing chart?"}},
    {"row": {"query": "I need technical support for a product.", "response": "We're here to help. Can you please provide the product name, SKU, or serial number, and a description of the issue you're experiencing?"}},
    {"row": {"query": "Can I exchange an item for a different color?", "response": "Certainly. Can you please provide your order number and the details of the item you'd like to exchange?"}},
    {"row": {"query": "How do I apply for a store credit card?", "response": "Thank you for your interest. Can you please provide your email address so we can send you information on how to apply?"}},
    {"row": {"query": "Where is your store located?", "response": "We'd be happy to help you find a store near you. Can you please provide your city and state or zip code?"}},
    {"row": {"query": "I can't log into my account.", "response": "We apologize for the inconvenience. Can you please provide your account email so we can help you troubleshoot the issue?"}},
    {"row": {"query": "Do you offer gift wrapping?", "response": "We do offer gift wrapping for select items. Can you please provide the product name or SKU so we can confirm if gift wrapping is available?"}},
    {"row": {"query": "Can I schedule a delivery?", "response": "Certainly. Can you please provide your order number and the preferred date and time for delivery?"}},
    {"row": {"query": "How do I unsubscribe from your newsletter?", "response": "We're sorry to see you go. Can you please provide your email address so we can remove you from our mailing list?"}},
    {"row": {"query": "What is your return policy?", "response": "We'd be happy to provide information on our return policy. Can you please provide the product name or SKU so we can give you the most accurate information?"}},
    {"row": {"query": "Do you offer price matching?", "response": "We do offer price matching in certain cases. Can you please provide the product name or SKU and the competitor's pricing information?"}},
    {"row": {"query": "Are there any current promotions or sales?", "response": "We'd be happy to inform you of any current promotions. Can you please provide the product name or SKU you're interested in, or the type of promotion you're looking for?"}},
    {"row": {"query": "My coupon isn't working.", "response": "We apologize for the inconvenience. Can you please provide the coupon code and the product name or SKU you're trying to apply it to?"}},
    {"row": {"query": "Can you help me with a product recommendation?", "response": "Of course! Can you please provide some details about what you're looking for, such as product type, features, or price range?"}},
    {"row": {"query": "Do you offer international shipping?", "response": "We'd be happy to help. Can you please provide your shipping destination and the product name or SKU you're interested in?"}},
    {"row": {"query": "Can I place an order over the phone?", "response": "Certainly. Can you please provide your phone number and the best time to reach you, and one of our representatives will contact you to place the order?"}},
    {"row": {"query": "How do I know if my order went through?", "response": "We can help you with that. Can you please provide your account email or order number so we can check the status for you?"}},
    {"row": {"query": "I received the wrong item in my order.", "response": "We apologize for the mistake. Can you please provide your order number and a description of the item you received so we can correct the issue?"}},
    {"row": {"query": "What payment methods do you accept?", "response": "We accept a variety of payment methods. Can you please provide the product name or SKU you're interested in so we can provide more specific payment options?"}},
    {"row": {"query": "Can I get a replacement for a faulty item?", "response": "Certainly. Can you please provide your order number and details of the item, and we'll arrange for a replacement?"}},
    {"row": {"query": "How do I contact customer support?", "response": "We'd be happy to assist. Can you please provide your preferred method of contact, such as email or phone, so we can direct you to the right support team?"}},
    {"row": {"query": "Can I track my return?", "response": "We can help you with that. Can you please provide your return tracking number or order number so we can check the status for you?"}},
    {"row": {"query": "How do I update my address in your system?", "response": "We can assist you with that. Can you please provide your account email and the new address you'd like to use?"}},
    {"row": {"query": "Do you have any special offers for new customers?", "response": "We do offer special promotions for new customers. Can you please provide your email address so we can send you the details?"}},
    {"row": {"query": "Can I change my order after it's been placed?", "response": "We'll do our best to help. Can you please provide your order number and the details of the change you'd like to make?"}},
    {"row": {"query": "What are your business hours?", "response": "We'd be happy to provide that information. Can you please specify your location so we can provide the relevant business hours?"}},
    {"row": {"query": "Can I pay with a gift card?", "response": "We do accept gift cards. Can you please provide the product name or SKU you're interested in so we can confirm if gift cards can be used for your purchase?"}},
    {"row": {"query": "How do I cancel an order?", "response": "We can help you with that. Can you please provide your order number and the reason for cancellation so we can process your request?"}},
    {"row": {"query": "I have a question about your products.", "response": "We'd be happy to assist. Can you please provide the product name or SKU and your question so we can give you more information?"}},
    {"row": {"query": "Can I get a discount on bulk purchases?", "response": "We do offer discounts on bulk purchases. Can you please provide the product name or SKU and the quantity you're interested in?"}},
    {"row": {"query": "Do you offer free shipping?", "response": "We do offer free shipping for certain orders. Can you please provide the product name or SKU and your shipping destination so we can confirm if you're eligible for free shipping?"}},
    {"row": {"query": "How can I sign up for your loyalty program?", "response": "We'd be happy to provide information on our loyalty program. Can you please provide your email address so we can send you the details?"}},
    {"row": {"query": "Can I use multiple promo codes on one order?", "response": "Unfortunately, only one promo code can be used per order. Can you please provide the promo codes you're trying to use so we can assist you further?"}},
    {"row": {"query": "How do I check the balance of my gift card?", "response": "We can help with that. Can you please provide the gift card number so we can check the balance for you?"}},
    {"row": {"query": "Can I get a sample of your product?", "response": "We can provide samples for certain products. Can you please provide the product name or SKU so we can check availability and send you a sample?"}},
    {"row": {"query": "How do I apply for a refund?", "response": "We'd be happy to assist. Can you please provide your order number and the reason for the refund request so we can process it accordingly?"}},
    {"row": {"query": "Can I make changes to my subscription?", "response": "Certainly. Can you please provide your subscription details and the changes you'd like to make so we can assist you?"}},
    {"row": {"query": "What should I do if I receive the wrong item?", "response": "We apologize for the mistake. Can you please provide your order number and a description of the incorrect item so we can resolve the issue?"}},
    {"row": {"query": "Do you offer free returns?", "response": "We do offer free returns for certain items. Can you please provide the product name or SKU and your return details so we can confirm if you're eligible for free returns?"}},
    {"row": {"query": "How do I know if my order is eligible for a discount?", "response": "We can help with that. Can you please provide your order number and details of the discount you're interested in so we can check eligibility?"}},
    {"row": {"query": "How can I check the status of my application?", "response": "We'd be happy to assist. Can you please provide your application number or details so we can check the status for you?"}},
    {"row": {"query": "Do you have a physical store?", "response": "We do have physical stores. Can you please provide your location or zip code so we can direct you to the nearest store?"}},
    {"row": {"query": "How do I provide feedback on my experience?", "response": "We appreciate your feedback. Can you please provide your email address so we can send you a feedback form?"}},
    {"row": {"query": "Can I change the delivery address after placing an order?", "response": "We'll do our best to assist. Can you please provide your order number and the new delivery address so we can update it for you?"}},
    {"row": {"query": "What is your policy on damaged items?", "response": "We have a policy for handling damaged items. Can you please provide your order number and details of the damage so we can assist you?"}},
    {"row": {"query": "How do I check the status of my warranty claim?", "response": "We can help with that. Can you please provide your claim number or the product's serial number so we can check the status for you?"}},
    {"row": {"query": "Can I update my billing information online?", "response": "Yes, you can update your billing information online. Can you please provide your account email so we can guide you through the process?"}},
    {"row": {"query": "How do I redeem a gift card?", "response": "We'd be happy to assist. Can you please provide your gift card number and the product name or SKU you're interested in so we can guide you through the redemption process?"}},
    {"row": {"query": "Do you offer product warranties?", "response": "We do offer product warranties for certain items. Can you please provide the product name or SKU so we can give you more information?"}},
    {"row": {"query": "How do I sign up for updates on new products?", "response": "We'd be happy to help you stay updated. Can you please provide your email address so we can add you to our mailing list for new product updates?"}},
    {"row": {"query": "Can I cancel my subscription at any time?", "response": "Yes, you can cancel your subscription at any time. Can you please provide your account email so we can assist you with the cancellation process?"}},
    {"row": {"query": "How do I check if an item is eligible for a discount?", "response": "We can help with that. Can you please provide the product name or SKU and the details of the discount you're interested in so we can check eligibility?"}},
    {"row": {"query": "What do I do if I didn't receive my order confirmation email?", "response": "We can assist with that. Can you please provide your order number or account email so we can resend the confirmation email?"}},
    {"row": {"query": "How do I add a payment method to my account?", "response": "We can help with that. Can you please provide your account email so we can guide you through the process of adding a payment method?"}},
    {"row": {"query": "Can I track my order with a tracking number?", "response": "Yes, you can track your order with a tracking number. Can you please provide the tracking number so we can check the status for you?"}},
    {"row": {"query": "How do I contact your sales department?", "response": "We'd be happy to connect you with our sales department. Can you please provide your contact information so we can direct you to the right representative?"}},
    {"row": {"query": "Can I use a gift card and a promo code on the same order?", "response": "Yes, you can use both a gift card and a promo code on the same order. Can you please provide the gift card number and promo code so we can assist you with applying them?"}},
    {"row": {"query": "How do I report a problem with your website?", "response": "We'd be happy to help. Can you please provide details about the problem you're experiencing and your contact information so we can address the issue?"}},
    {"row": {"query": "What is your policy on order cancellations?", "response": "We have a policy for order cancellations. Can you please provide your order number and the reason for the cancellation so we can assist you?"}},
    {"row": {"query": "Do you offer price matching?", "response": "We do offer price matching. Can you please provide the product name or SKU and the competitor's price so we can verify and assist you?"}},
    {"row": {"query": "How do I check my order history?", "response": "We can assist you with that. Can you please provide your account email so we can access your order history?"}},
    {"row": {"query": "Can I use a promo code on a sale item?", "response": "Promo codes may or may not be applied to sale items depending on the terms. Can you please provide the promo code and the sale item so we can check eligibility?"}},
    {"row": {"query": "How do I sign up for your newsletter?", "response": "We'd be happy to add you to our newsletter list. Can you please provide your email address so we can sign you up?"}},
    {"row": {"query": "Do you offer international shipping?", "response": "We do offer international shipping. Can you please provide your shipping destination so we can confirm if we can ship to your location?"}},
    {"row": {"query": "How do I apply for a credit limit increase?", "response": "We can assist with that. Can you please provide your account details so we can guide you through the credit limit increase process?"}},
    {"row": {"query": "Can I return a product purchased online to a physical store?", "response": "It depends on the store's return policy. Can you please provide the product name or SKU and the location of the physical store so we can check if returns are accepted?"}},
    {"row": {"query": "What is your policy on order modifications?", "response": "We have a policy for order modifications. Can you please provide your order number and details of the modification so we can assist you?"}},
    {"row": {"query": "How do I contact your technical support team?", "response": "We'd be happy to connect you with our technical support team. Can you please provide your contact information and details about the issue you're facing?"}},
    {"row": {"query": "Can I use a promo code and a gift card together?", "response": "Yes, you can use both a promo code and a gift card together. Can you please provide the promo code and gift card number so we can assist you with applying them?"}},
    {"row": {"query": "What should I do if I receive a damaged item?", "response": "We apologize for the inconvenience. Can you please provide your order number and details of the damage so we can assist you with a replacement or refund?"}},
    {"row": {"query": "Do you offer customer support via chat?", "response": "Yes, we do offer customer support via chat. Can you please provide your contact information so we can connect you with a support representative?"}},
    {"row": {"query": "How do I update my payment information?", "response": "We can help with that. Can you please provide your account email so we can guide you through the process of updating your payment information?"}},
    {"row": {"query": "Can I get a refund for a gift card?", "response": "Unfortunately, gift cards are non-refundable. Can you please provide your gift card number so we can assist you further?"}},
    {"row": {"query": "How do I reset my password?", "response": "We can assist with that. Can you please provide your account email so we can guide you through the password reset process?"}},
    {"row": {"query": "Can I get a discount for being a loyal customer?", "response": "We do offer discounts for loyal customers. Can you please provide your account details so we can check your eligibility?"}},
    {"row": {"query": "How do I find out if my order has shipped?", "response": "We can help with that. Can you please provide your order number so we can check the shipping status for you?"}},
    {"row": {"query": "Can I track my package with a tracking number?", "response": "Yes, you can track your package using a tracking number. Can you please provide the tracking number so we can check the status for you?"}},
    {"row": {"query": "How do I redeem a promo code?", "response": "We'd be happy to assist. Can you please provide the promo code and details about the order so we can guide you through the redemption process?"}},
    {"row": {"query": "Can I get a sample of your new product?", "response": "We can provide samples for new products. Can you please provide the product name or SKU so we can check availability and send you a sample?"}},
    {"row": {"query": "What is your policy on price adjustments?", "response": "We have a policy for price adjustments. Can you please provide your order number and details of the price change so we can assist you?"}},
    {"row": {"query": "How do I apply for a return authorization?", "response": "We can assist with that. Can you please provide your order number and the reason for the return so we can guide you through the return authorization process?"}},
    {"row": {"query": "Do you offer any trade-in programs?", "response": "We do offer trade-in programs for certain products. Can you please provide the product name or SKU so we can give you more information?"}},
    {"row": {"query": "How do I contact your customer service department?", "response": "We'd be happy to connect you with our customer service department. Can you please provide your contact information so we can direct you to the right representative?"}},
    {"row": {"query": "Can I use a gift card and a promo code together on an order?", "response": "Yes, you can use both a gift card and a promo code together on an order. Can you please provide the gift card number and promo code so we can assist you with applying them?"}},
    {"row": {"query": "How do I request a product catalog?", "response": "We'd be happy to send you a product catalog. Can you please provide your email address so we can send you the catalog?"}},
    {"row": {"query": "Do you offer any financing options?", "response": "We do offer financing options. Can you please provide the product name or SKU and your preferred financing option so we can give you more information?"}},
    {"row": {"query": "How do I update my shipping address?", "response": "We can assist with that. Can you please provide your order number and the new shipping address so we can update it for you?"}},
    {"row": {"query": "Can I use multiple gift cards on one order?", "response": "Yes, you can use multiple gift cards on one order. Can you please provide the gift card numbers so we can assist you with applying them?"}},
    {"row": {"query": "How do I change my email address associated with my account?", "response": "We can help with that. Can you please provide your account email and the new email address you'd like to use?"}},
    {"row": {"query": "Do you offer expedited shipping?", "response": "We do offer expedited shipping options. Can you please provide the product name or SKU and your shipping destination so we can give you more details?"}},
    {"row": {"query": "How do I check the status of my order?", "response": "We can assist with that. Can you please provide your order number so we can check the status for you?"}},
    {"row": {"query": "Can I use a promo code on an already discounted item?", "response": "Promo codes may or may not apply to already discounted items depending on the terms. Can you please provide the promo code and the item so we can check eligibility?"}},
    {"row": {"query": "How do I get a copy of my receipt?", "response": "We can help with that. Can you please provide your order number or account email so we can send you a copy of your receipt?"}},
    {"row": {"query": "Can I use a gift card for a subscription service?", "response": "Unfortunately, gift cards cannot be used for subscription services. Can you please provide more details about your subscription so we can assist you further?"}},
    {"row": {"query": "How do I contact your support team for technical issues?", "response": "We can connect you with our support team for technical issues. Can you please provide your contact information and details about the technical issue you're experiencing?"}},
    {"row": {"query": "What is your policy on product exchanges?", "response": "We have a policy for product exchanges. Can you please provide your order number and details of the exchange so we can assist you?"}},
    {"row": {"query": "How do I check the balance on my gift card?", "response": "We can assist with that. Can you please provide your gift card number so we can check the balance for you?"}},
    {"row": {"query": "Can I use a promo code and a gift card on the same order?", "response": "Yes, you can use both a promo code and a gift card on the same order. Can you please provide the promo code and gift card number so we can assist you with applying them?"}},
    {"row": {"query": "How do I apply for a credit card?", "response": "We can assist with that. Can you please provide your contact information so we can guide you through the credit card application process?"}}
  ]
}
